0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

Uinlet          (2.5 0 0);

internalField   uniform (2.5 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $Uinlet;
    }
    outlet
    {
        type            zeroGradient;
    }
    "fan1|fan2"
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    walls
    {
		type            pressureInletOutletVelocity;
		tangentialVelocity   uniform $Uinlet;
		value           $internalField;
    }
    "AMI1|AMI2"
    {
        type            cyclicAMI;
        value           $internalField;
    }
}


// ************************************************************************* //
