system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.4;

deltaT          1e-5;
writeControl    adjustableRunTime;
writeInterval   0.01;

////- For testing with moveDynamicMesh
//deltaT          1e-5;
//writeControl    runTime;
//writeInterval   0.001;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

maxDeltaT       0.0025;

functions
{
    #includeFunc Q
    #include "forces"
    probes1
    {
        
        libs            ("libsampling.so");
        type            probes;
        name            probes_velocity;
        writeControl    runTime;
        writeInterval   0.00005;
        fields          (U);
        probeLocations
        (
            ( 3 -0.28 0 ) 
        );
    }
    probes2
    {
        
        libs            ("libsampling.so");
        type            probes;
        name            probes_pressure1;
        writeControl    runTime;
        writeInterval   0.00005;
        fields          (p);
        fixedLocations	false;
        probeLocations
        (
            ( 2.295 0.294323 0.151898 )
        );
    }
	probes3
    {
        
        libs            ("libsampling.so");
        type            probes;
        name            probes_pressure2;
        writeControl    runTime;
        writeInterval   0.00005;
        fields          (p);
        fixedLocations	false;
        probeLocations
        (
			( 2.49719 0.332242 -0.013025 )
        );
    }
}

// ************************************************************************* //
